tap "homebrew/services"
brew "ffmpeg"
brew "fish"
brew "ghq"
brew "gibo"
brew "git"
brew "git-extras"
brew "go"
brew "jq"
brew "python@3.13"
brew "macvim"
brew "mas"
brew "node"
brew "oath-toolkit"
brew "openjdk@21"
brew "p7zip"
brew "peco"
cask "blackhole-2ch"
cask "iterm2"
cask "visual-studio-code"
mas "Drafts", id: 1435957248
mas "Hidden Bar", id: 1452453066
mas "MenubarX", id: 1575588022
mas "Notability", id: 360593530
mas "PopClip", id: 445189367
mas "RunCat", id: 1429033973
mas "Slack", id: 803453959
vscode "alefragnani.project-manager"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "golang.go"
vscode "huizhou.githd"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "octref.vetur"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "shardulm94.trailing-spaces"
vscode "swellaby.node-pack"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "withfig.fig"
