tap "homebrew/autoupdate"
tap "oven-sh/bun"
brew "python@3.13"
brew "aws-sam-cli"
brew "awscli"
brew "cask"
brew "eza"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "node"
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "git"
brew "git-extras"
brew "go"
brew "grc"
brew "jq"
brew "macvim"
brew "mas"
brew "nvm"
brew "oath-toolkit"
brew "openjdk"
brew "openjdk@21"
brew "p7zip"
brew "peco"
brew "pinentry-mac"
brew "qpdf"
brew "uv"
brew "oven-sh/bun/bun"
cask "blackhole-2ch"
cask "claude-code"
cask "cursor"
cask "docker-desktop"
cask "font-cica"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "iterm2"
cask "monitorcontrol"
cask "visual-studio-code"
mas "CotEditor", id: 1024640650
mas "Disk Diag", id: 672206759
mas "Drafts", id: 1435957248
mas "Hidden Bar", id: 1452453066
mas "LINE", id: 539883307
mas "MenubarX", id: 1575588022
mas "Notability", id: 360593530
mas "PopClip", id: 445189367
mas "RunCat", id: 1429033973
mas "Slack", id: 803453959
vscode "alefragnani.project-manager"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "huizhou.githd"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "swellaby.node-pack"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "withfig.fig"
vscode "yzane.markdown-pdf"
